change to plantuml diagram
